//-------------------------------------------------------------	-------------------------------------------------
//オブジェクトを生成する窓口
//-----------------------------------------------------------------------------------------------------------------------------
#include "AppearObject.h"
//生成対象にするものはすべてinclude
#include  "Task_Player.h"

//#include  "Task_Effect00.h"
//------------------------------------------------------------------------------------------------------
//BCharaを継承しているタスク専用
//名称指定のみで、対応しているタスクを生成し、エンジンに登録する
BChara::SP  AppearObject_BChara(const string& name_)
{
	//生成
	BChara::SP w = nullptr;
	if ("Player"==name_)
	{
		w = Player::Object::Create(true);
	}
	
	/*else if ("Effect00" == name_)
	{
		w = Effect00::Object::Create(true);
	}*/
	return w;
}